<?php

return [
    'name' => 'Image',

    /*
    |--------------------------------------------------------------------------
    | Мягкое удаление
    |--------------------------------------------------------------------------
    |
    | Позволяет не удалять физически изображения с жесткого диска
    |
    */
    'soft_deletes' => env('IMAGE_SOFT', true),

    /*
    |--------------------------------------------------------------------------
    | Место хранения записей об изображениях
    |--------------------------------------------------------------------------
    |
    | Здесь можно определить место хранения для записей об изображениях.
    | Доступны значения: "database" - база данных, "mongodb" - MongoDb
    |
    */
    'record' => env('IMAGE', 'database'),

    /*
    |--------------------------------------------------------------------------
    | Драйвер хранения изображений
    |--------------------------------------------------------------------------
    |
    | Определяем систему хранения изображений.
    | base - в базе данных, local - локально в папке, ftp - через FTP протокол в папке
    | http - через HTTP протокол в папке
    |
    */
    'store_driver' => env('IMAGE_DRIVER', 'local'),


    /*
    |--------------------------------------------------------------------------
    | Настройка хранилища для изображений
    |--------------------------------------------------------------------------
    |
    | В этом месте можно определить доступы к хранилищу изображений
    |
    */
    'store' => [
        'base' => [
            'table' => 'images',
            'property' => 'byte'
        ],
        'local' => [
            'path' => 'storage/images/',
            'pathSource' => storage_path('app/public/images/'),
        ],
        'ftp' => [
            'server' => 'courselandia.ru',
            'login' => 'courselandia',
            'password' => 'O4z1S0f6',
            'path' => 'www/images/'
        ],
        'http' => [
            'read' => 'http://loc.courselandia.ru/storage/images/',
            'create' => 'http://loc.courselandia.ru/img/create/',
            'update' => 'http://loc.courselandia.ru/img/update/',
            'destroy' => 'http://loc.courselandia.ru/img/destroy/',
        ]
    ]
];
