<?php

return [
    'repositoryEloquent' => [
        'record_exist' => 'Запись не существует.'
    ],
    'repositoryTreeEloquent' => [
        'node_not_exist' => 'Узел не существует.'
    ],
    'sms' => [
        'smsCenter' => [
            'errors' => [
                'params' => 'Ошибка в параметрах.',
                'access' => 'Неверный логин или пароль.',
                'balance' => 'Недостаточно средств на счете Клиента.',
                'block' => 'IP-адрес временно заблокирован из-за частых ошибок в запросах.',
                'format' => 'Неверный формат даты.',
                'prohibited' => 'Сообщение запрещено (по тексту или по имени отправителя).',
                'invalid' => 'Неверный формат номера телефона.',
                'unreached' => 'Сообщение на указанный номер не может быть доставлено.',
                'limit' => 'Отправка более одного одинакового запроса на передачу SMS-сообщения либо более пяти одинаковых запросов на получение стоимости сообщения в течение минуты.',
                'not_exist' => 'Сообщение не найдено.',
                'processing' => 'Ожидает отправки.',
                'transmitted' => 'Передано оператору.',
                'expired' => 'Просрочено.',
                'undelivered' => 'Невозможно доставить.',
                'unavailable' => 'Недоступный номер.',
                'undefined' => 'Неизвестная ошибка исполнения.'
            ]
        ]
    ]
];
